# Reading & Writing Files in Pandas

# CSVs Files
---
**Read CSV**

In [1]:
import pandas as pd

In [4]:
df = pd.read_csv("data.csv")
df

     Name of Students                                 College  CGPA
0         Aarav Mehta                              IIT Bombay  9.10
1        Priya Sharma                        Delhi University  8.70
2         Rohan Gupta                             BITS Pilani  9.30
3          Sneha Iyer                         Anna University  8.50
4         Karan Patel                              NIT Trichy  8.90
5        Ananya Verma                     Jadavpur University  9.00
6        Aditya Joshi                         Pune University  8.60
7       Neha Kulkarni      Symbiosis International University  8.80
8         Vivek Singh                Banaras Hindu University  9.20
9          Meera Nair                       Christ University  8.40
10     Rahul Deshmukh        Savitribai Phule Pune University  8.70
11       Tanya Kapoor                        Amity University  8.30
12      Siddharth Rao   SRM Institute of Science & Technology  8.90
13       Pooja Mishra                    Jamia Millia Islamia  8.50
14        Arjun Reddy                      Osmania University  8.60
15         Kavya Jain                       Mumbai University  9.00
16       Manish Kumar          Lovely Professional University  8.20
17    Shreya Banerjee                   Presidency University  8.70
18       Deepak Yadav                   Chandigarh University  8.40
19  Bhavesh Chandwani  Chhatrapati Shivaji Maharaj University  8.68

In [8]:
df = df[df['CGPA'] > 8.5]
df

     Name of Students                                 College  CGPA
0         Aarav Mehta                              IIT Bombay  9.10
1        Priya Sharma                        Delhi University  8.70
2         Rohan Gupta                             BITS Pilani  9.30
4         Karan Patel                              NIT Trichy  8.90
5        Ananya Verma                     Jadavpur University  9.00
6        Aditya Joshi                         Pune University  8.60
7       Neha Kulkarni      Symbiosis International University  8.80
8         Vivek Singh                Banaras Hindu University  9.20
10     Rahul Deshmukh        Savitribai Phule Pune University  8.70
12      Siddharth Rao   SRM Institute of Science & Technology  8.90
14        Arjun Reddy                      Osmania University  8.60
15         Kavya Jain                       Mumbai University  9.00
17    Shreya Banerjee                   Presidency University  8.70
19  Bhavesh Chandwani  Chhatrapati Shivaji Maharaj University  8.68

**Write CSV**

In [10]:
df.to_csv("updated_data.csv", index=False)   #Index will not be highlighted in excel

**Creating Excel File**

In [12]:

data = {
    "Region": ["East", "West", "East", "West"],
    "Month": ["Jan", "Jan", "Feb", "Feb"],
    "Revenue": [12000, 15000, 13000, 16000]
}
df = pd.DataFrame(data)
df

  Region Month  Revenue
0   East   Jan    12000
1   West   Jan    15000
2   East   Feb    13000
3   West   Feb    16000

In [14]:
df.to_excel("Sales_Data.xlsx", sheet_name="Sales", index=False)

**Reading Excel File**

In [16]:
df_read = pd.read_excel("Sales_Data.xlsx", sheet_name="Sales")
df_read

  Region Month  Revenue
0   East   Jan    12000
1   West   Jan    15000
2   East   Feb    13000
3   West   Feb    16000

In [17]:
# Summarize revenue by region
summary = df_read.groupby("Region")["Revenue"].sum().reset_index()
summary

  Region  Revenue
0   East    25000
1   West    31000

**Write Excel**

In [19]:
summary.to_excel("region_summary.xlsx", index=False)

**Read Json**

In [21]:
df = pd.read_json("data.json")
df

     Name of Students                                 College  CGPA
0         Aarav Mehta                              IIT Bombay  9.10
1        Priya Sharma                        Delhi University  8.70
2         Rohan Gupta                             BITS Pilani  9.30
3          Sneha Iyer                         Anna University  8.50
4         Karan Patel                              NIT Trichy  8.90
5        Ananya Verma                     Jadavpur University  9.00
6        Aditya Joshi                         Pune University  8.60
7       Neha Kulkarni      Symbiosis International University  8.80
8         Vivek Singh                Banaras Hindu University  9.20
9          Meera Nair                       Christ University  8.40
10     Rahul Deshmukh        Savitribai Phule Pune University  8.70
11       Tanya Kapoor                        Amity University  8.30
12      Siddharth Rao   SRM Institute of Science & Technology  8.90
13       Pooja Mishra                    Jamia Millia Islamia  8.50
14        Arjun Reddy                      Osmania University  8.60
15         Kavya Jain                       Mumbai University  9.00
16       Manish Kumar          Lovely Professional University  8.20
17    Shreya Banerjee                   Presidency University  8.70
18       Deepak Yadav                   Chandigarh University  8.40
19  Bhavesh Chandwani  Chhatrapati Shivaji Maharaj University  8.68